Revit 2027 API
Railing.CanReset Property
 True if the railing can be reset, False otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanReset { get; }
Public ReadOnly Property CanReset As Boolean
	Get
public:
property bool CanReset {
	bool get ();
}
member CanReset : bool with get
Property Value
Boolean
Remarks
 A Railing can be reset only if the railing was created in Revit later than version 9.1.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace